Revit 2026 API

# ReferenceIntersectorSetFilter Method

---

Sets the ElementFilter used in intersection testing.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFilter(
	ElementFilter filter
)
```
```vb
Public Sub SetFilter (
	filter As ElementFilter
)
```
```cpp
public:
void SetFilter(
	ElementFilter^ filter
)
```
```fsharp
member SetFilter :
        filter : ElementFilter -> unit
```

#### Parameters

filter ElementFilter
     The ElementFilter. Pass  to remove the existing filter.

#### Reference

ReferenceIntersector Class

Autodesk.Revit.DB Namespace